Repository: Saliba/Internationalization
Catalog: po/*.po
Languages: pt_br

source: Another option is use <a href="https://angular-gettext.rocketeer.be/dev-guide/extract/">angular-gettext</a> to extract all the words that are configured to be translated.
pt_br: Outra opção é utilizar o <a href="https://angular-gettext.rocketeer.be/dev-guide/extract/">angular-gettext</a> para extrair todas as palavras que foram configuradas para serem traduzidas

source: Can I easily translate an existing app ?
pt_br: Posso facilmente traduzir uma aplicação já existente ?

source: How ?
pt_br: Como ?

source: Internationalization - i18n
pt_br: Internacionalização - i18n

source: Toggle navigation
pt_br: Alternar de navegação

source: When ?
pt_br: Quando ?

source: When you are building a web application you will problably want to target as many users as you can, to do so, you must to be available globaly, but when it comes to the point of receiving foreing visitors you should make your website more friendly to them.
pt_br: Quando você estiver criando um aplicativo da web, você irá provavelmente querer atingir o maior número de usuários possível, para isso, você deve estar disponível globalmente, mas quando se trata de receber visitantes de outros países você deve fazer um site mais amigável para eles.

source: Why ?
pt_br: Por que ?

source: Yes, using angular-gettext you can translate some parts of the site without any impact, it can also help you to find the texts that you haven't translated yet based on a configuration parameter.
pt_br: Sim, usando gettext-angular, você pode traduzir algumas partes do site sem qualquer impacto, ele pode também ajudá-lo a encontrar os textos que você ainda não traduziu com base em um parâmetro de configuração.

source: You can change the current language on the header menu without reloading the page.
pt_br: Você pode alterar o idioma atual no menu de cabeçalho sem recarregar a página.

source: You can use a tool called <a href="http://poedit.net/" target="_blank">Poedit</a> to translate each sentence.
pt_br: Você pode utilizar uma ferramenta chamada <a href="http://poedit.net/" target="_blank">Poedit</a> para traduzir cada frase.

source: You have a lot of options to translate your website, but today I will talk about <a href="https://angular-gettext.rocketeer.be/" target="_blank">angular-gettext</a>, the translator that we use here in Packdocs. By the way, AngularJs has support for <a href="https://docs.angularjs.org/api/ng/filter/currency" target="_blank">currency</a> and <a href="https://docs.angularjs.org/api/ng/filter/number" target="_blank">number</a> locale formating.
pt_br: Você tem varias opções quando se trata de traduzir o seu site, porem hoje, eu vou falar sobre o <a href="https://angular-gettext.rocketeer.be/" target="_blank">angular-gettext</a>, o tradutor que utilizamos aqui no Packdocs. Falando nisso, o AngularJS tem suporte para formatar <a href="https://docs.angularjs.org/api/ng/filter/currency" target="_blank">currency</a> e <a href="https://docs.angularjs.org/api/ng/filter/number" target="_blank">number</a> de acordo com o local.

source: You should start translating your website since the creation of it, but most of the time, on the begging you don't have time/hands to do it. The good new is that you can start doing it whenever you want.
pt_br: Você deve começar a traduzir o seu site desde a criação do mesmo, mas na maioria das vezes no começo você não tem tempo/braço para fazer isso. A boa notícia é que você pode começar a fazer isso a qualquer momento.
